devdnl/dnx-rtos/src/system/drivers/i2c/stm32f4/i2c.c
/*=========================================================================*//**
@file    i2c.c

@author  Daniel Zorychta

@brief   This driver support I2C peripherals.

@note    Copyright (C) 2017  Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

// NOTE: 10-bit addressing mode is experimental and not tested!

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "stm32f4/i2c_cfg.h"
#include "stm32f4/stm32f4xx.h"
#include "../i2c_ioctl.h"
#include "lib/stm32f4xx_rcc.h"

#include "stm32f4/gpio_cfg.h" // TEST
#include "gpio_ddi.h" // TEST

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define ACCESS_TIMEOUT         30000
#define DEVICE_TIMEOUT         2000
#define HEADER_ADDR_10BIT      0xF0

#define USE_DMA ((_I2C1_USE_DMA > 0) || (_I2C2_USE_DMA > 0) || (_I2C3_USE_DMA > 0))

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
enum _I2C_major {
        #if defined(RCC_APB1ENR_I2C1EN)
        _I2C1,
        #endif
        #if defined(RCC_APB1ENR_I2C2EN)
        _I2C2,
        #endif
        #if defined(RCC_APB1ENR_I2C3EN)
        _I2C3,
        #endif
        _I2C_NUMBER_OF_PERIPHERALS
};

/// type defines configuration of single I2C peripheral
typedef struct {
    #if USE_DMA > 0
        const bool                use_DMA;              //!< peripheral uses DMA and IRQ (true), or only IRQ (false)
        const DMA_Stream_TypeDef *const DMA_tx;         //!< pointer to the DMA Tx channel peripheral
        const DMA_Stream_TypeDef *const DMA_rx;         //!< pointer to the DMA Rx channel peripheral
        const u8_t                DMA_tx_number;        //!< number of channel of DMA Tx
        const u8_t                DMA_rx_number;        //!< number of channel of DMA Rx
        const u8_t                DMA_channel;          //!< DMA channel number
        const IRQn_Type           DMA_tx_IRQ_n;         //!< number of interrupt in the vector table
        const IRQn_Type           DMA_rx_IRQ_n;         //!< number of interrupt in the vector table
    #endif
        const I2C_TypeDef        *const I2C;            //!< pointer to the I2C peripheral
        const u32_t               freq;                 //!< peripheral SCL frequency [Hz]
        const u32_t               APB1ENR_clk_mask;     //!< mask used to enable I2C clock in the APB1ENR register
        const IRQn_Type           IRQ_EV_n;             //!< number of event IRQ vector
        const IRQn_Type           IRQ_ER_n;             //!< number of error IRQ vector
} I2C_info_t;

/// type defines I2C device in the runtime environment
typedef struct {
        I2C_config_t              config;               //!< pointer to the device configuration
        dev_lock_t                lock;                 //!< object used to lock access to opened device
        u8_t                      major;                //!< major number of the device (I2C peripheral number)
        u8_t                      minor;                //!< minor number of the device (device identifier)
} I2C_dev_t;

/// type defines main memory of this module
typedef struct {
        mutex_t                  *lock;                 //!< mutex used to lock access to the particular peripheral
        sem_t                    *event;                //!< semaphore used to indicate event (operation finished)
        u16_t                     SR1_mask;             //!< SR1 register mask (to catch specified event in IRQ)
        bool                      use_DMA:1;            //!< true if peripheral use DMA channels
        bool                      initialized:1;        //!< indicates that module for this peripheral is initialized
        u8_t                      dev_cnt;              //!< number of initialized devices
        u8_t                      error;                //!< error number (errno)
        u8_t                      unexp_event_cnt;      //!< number of unexpected events
} I2C_mem_t;


/*==============================================================================
  Local function prototypes
==============================================================================*/
static void release_resources(u8_t major);
static inline I2C_TypeDef *get_I2C(I2C_dev_t *hdl);
static int _I2C_LLD__init(u8_t major);
static void _I2C_LLD__release(u8_t major);
static int _I2C_LLD__start(I2C_dev_t *hdl);
static int _I2C_LLD__repeat_start(I2C_dev_t *hdl);
static void _I2C_LLD__stop(I2C_dev_t *hdl);
static int _I2C_LLD__send_address(I2C_dev_t *hdl, bool write);
static void clear_send_address_event(I2C_dev_t *hdl);
static int send_subaddress(I2C_dev_t *hdl, u32_t address, I2C_sub_addr_mode_t mode);
static void set_ACK_according_to_reception_size(I2C_dev_t *hdl, size_t count);
static int _I2C_LLD__receive(I2C_dev_t *hdl, u8_t *dst, size_t count, size_t *rdcnt);
static int _I2C_LLD__transmit(I2C_dev_t *hdl, const u8_t *src, size_t count, size_t *wrcnt);
static void IRQ_EV_handler(u8_t major);
static void IRQ_ER_handler(u8_t major);

/*==============================================================================
  Local object definitions
==============================================================================*/
MODULE_NAME(I2C);

/// peripherals configuration
static const I2C_info_t I2C_INFO[_I2C_NUMBER_OF_PERIPHERALS] = {
        #if defined(RCC_APB1ENR_I2C1EN)
        {
                #if USE_DMA > 0
                .use_DMA          = _I2C1_USE_DMA,
                .DMA_tx           = DMA1_Stream6,
                .DMA_rx           = DMA1_Stream7,
                .DMA_tx_number    = 6,
                .DMA_rx_number    = 5,
                .DMA_channel      = 1,
                .DMA_tx_IRQ_n     = DMA1_Stream6_IRQn,
                .DMA_rx_IRQ_n     = DMA1_Stream5_IRQn,
                #endif
                .I2C              = I2C1,
                .freq             = _I2C1_FREQUENCY,
                .APB1ENR_clk_mask = RCC_APB1ENR_I2C1EN,
                .IRQ_EV_n         = I2C1_EV_IRQn,
                .IRQ_ER_n         = I2C1_ER_IRQn,
        },
        #endif
        #if defined(RCC_APB1ENR_I2C2EN)
        {
                #if USE_DMA > 0
                .use_DMA          = _I2C2_USE_DMA,
                .DMA_tx           = DMA1_Stream7,
                .DMA_rx           = DMA1_Stream3,
                .DMA_tx_number    = 7,
                .DMA_rx_number    = 3,
                .DMA_channel      = 7,
                .DMA_tx_IRQ_n     = DMA1_Stream7_IRQn,
                .DMA_rx_IRQ_n     = DMA1_Stream3_IRQn,
                #endif
                .I2C              = I2C2,
                .freq             = _I2C2_FREQUENCY,
                .APB1ENR_clk_mask = RCC_APB1ENR_I2C2EN,
                .IRQ_EV_n         = I2C2_EV_IRQn,
                .IRQ_ER_n         = I2C2_ER_IRQn,
        },
        #endif
        #if defined(RCC_APB1ENR_I2C3EN)
        {
                #if USE_DMA > 0
                .use_DMA          = _I2C3_USE_DMA,
                .DMA_tx           = DMA1_Stream4,
                .DMA_rx           = DMA1_Stream2,
                .DMA_tx_number    = 4,
                .DMA_rx_number    = 2,
                .DMA_channel      = 3,
                .DMA_tx_IRQ_n     = DMA1_Stream4_IRQn,
                .DMA_rx_IRQ_n     = DMA1_Stream2_IRQn,
                #endif
                .I2C              = I2C3,
                .freq             = _I2C3_FREQUENCY,
                .APB1ENR_clk_mask = RCC_APB1ENR_I2C3EN,
                .IRQ_EV_n         = I2C3_EV_IRQn,
                .IRQ_ER_n         = I2C3_ER_IRQn,
        },
        #endif
};

/// default peripheral configuration
static const I2C_config_t I2C_DEFAULT_CFG = {
        .address       = 0x00,
        .addr_10bit    = false,
        .sub_addr_mode = I2C_SUB_ADDR_MODE__DISABLED,
};

/// main memory of module
static I2C_mem_t *I2C[_I2C_NUMBER_OF_PERIPHERALS];

/*==============================================================================
  Exported object definitions
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_INIT(I2C, void **device_handle, u8_t major, u8_t minor)
{
        int err = ENODEV;

        if (major >= _I2C_NUMBER_OF_PERIPHERALS) {
                return err;
        }

        /* creates basic module structures */
        if (I2C[major] == NULL) {
                err = sys_zalloc(sizeof(I2C_mem_t), cast(void**, &I2C[major]));
                if (err) {
                        goto finish;
                }

                err = sys_mutex_create(MUTEX_TYPE_NORMAL, &I2C[major]->lock);
                if (err) {
                        goto finish;
                }

                err = sys_semaphore_create(1, 0, &I2C[major]->event);
                if (err) {
                        goto finish;
                }

                err = _I2C_LLD__init(major);
                if (err) {
                        goto finish;
                }
        }

        /* creates device structure */
        err = sys_zalloc(sizeof(I2C_dev_t), device_handle);
        if (!err) {
                I2C_dev_t *hdl = *device_handle;
                hdl->config    = I2C_DEFAULT_CFG;
                hdl->major     = major;
                hdl->minor     = minor;

