devdnl/dnx-rtos/src/system/drivers/i2c/stm32f4/i2c.c
                sys_device_unlock(&hdl->lock, true);

                I2C[major]->dev_cnt++;
        }

        finish:
        if (err) {
                release_resources(major);
        }

        return err;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_RELEASE(I2C, void *device_handle)
{
        I2C_dev_t *hdl = device_handle;

        int err = sys_device_lock(&hdl->lock);
        if (!err) {
                I2C[hdl->major]->dev_cnt--;
                release_resources(hdl->major);
                sys_free(device_handle);
        }

        return err;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_OPEN(I2C, void *device_handle, u32_t flags)
{
        UNUSED_ARG1(flags);

        I2C_dev_t *hdl = device_handle;

        return sys_device_lock(&hdl->lock);
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_CLOSE(I2C, void *device_handle, bool force)
{
        I2C_dev_t *hdl = device_handle;

        return sys_device_unlock(&hdl->lock, force);
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *wrcnt                  number of written bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_WRITE(I2C,
              void             *device_handle,
              const u8_t       *src,
              size_t            count,
              fpos_t           *fpos,
              size_t           *wrcnt,
              struct vfs_fattr  fattr)
{
        UNUSED_ARG1(fattr);

        I2C_dev_t *hdl = device_handle;

        int err = sys_mutex_lock(I2C[hdl->major]->lock, ACCESS_TIMEOUT);
        if (!err) {

                err = _I2C_LLD__start(hdl);
                if (err) goto error;

                err = _I2C_LLD__send_address(hdl, true);
                if (err) {
                        goto error;
                }

                if (hdl->config.sub_addr_mode != I2C_SUB_ADDR_MODE__DISABLED) {
                        err = send_subaddress(hdl, *fpos, hdl->config.sub_addr_mode);
                        if (err) goto error;
                }

                err = _I2C_LLD__transmit(hdl, src, count, wrcnt);

                error:
                sys_mutex_unlock(I2C[hdl->major]->lock);
        }

        return err;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdcnt                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_READ(I2C,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdcnt,
             struct vfs_fattr fattr)
{
        UNUSED_ARG1(fattr);

        I2C_dev_t *hdl = device_handle;

        int err = sys_mutex_lock(I2C[hdl->major]->lock, ACCESS_TIMEOUT);
        if (!err) {

                if (hdl->config.sub_addr_mode != I2C_SUB_ADDR_MODE__DISABLED) {
                        err = _I2C_LLD__start(hdl);
                        if (err) goto error;

                        err = _I2C_LLD__send_address(hdl, true);
                        if (err) goto error;

                        err = send_subaddress(hdl, *fpos, hdl->config.sub_addr_mode);
                        if (err) goto error;
                }

                err = _I2C_LLD__repeat_start(hdl);
                if (err) goto error;

                set_ACK_according_to_reception_size(hdl, count);

                err = _I2C_LLD__send_address(hdl, false);
                if (err) goto error;

                err = _I2C_LLD__receive(hdl, dst, count, rdcnt);

                error:
                sys_mutex_unlock(I2C[hdl->major]->lock);
        }

        return err;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_IOCTL(I2C, void *device_handle, int request, void *arg)
{
        I2C_dev_t *hdl = device_handle;
        int        err = EINVAL;

