devdnl/dnx-rtos/src/system/drivers/i2c/stm32f4/i2c.c
        _GPIO_DDI_clear_pin(IOCTL_GPIO_PORT_IDX__TEST2, IOCTL_GPIO_PIN_IDX__TEST2); //TEST
}

//==============================================================================
/**
 * @brief  Error IRQ handler
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
static void IRQ_ER_handler(u8_t major)
{
        _GPIO_DDI_set_pin(IOCTL_GPIO_PORT_IDX__TEST4, IOCTL_GPIO_PIN_IDX__TEST4); //TEST
        _GPIO_DDI_clear_pin(IOCTL_GPIO_PORT_IDX__TEST4, IOCTL_GPIO_PIN_IDX__TEST4); //TEST
        _GPIO_DDI_set_pin(IOCTL_GPIO_PORT_IDX__TEST4, IOCTL_GPIO_PIN_IDX__TEST4); //TEST

        I2C_TypeDef *i2c = const_cast(I2C_TypeDef*, I2C_INFO[major].I2C);
        u16_t SR1 = i2c->SR1;
        u16_t SR2 = i2c->SR2;
        UNUSED_ARG1(SR2);

        if (SR1 & I2C_SR1_ARLO) {
                I2C[major]->error = EAGAIN;

        } else if (SR1 & I2C_SR1_AF) {
                if (I2C[major]->SR1_mask & (I2C_SR1_ADDR | I2C_SR1_ADD10))
                        I2C[major]->error = ENXIO;
                else
                        I2C[major]->error = EIO;
        } else {
                I2C[major]->error = EIO;
        }

        // clear error flags
        i2c->SR1 = 0;

        bool woken = false;
        sys_semaphore_signal_from_ISR(I2C[major]->event, &woken);

        CLEAR_BIT(i2c->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);
        sys_thread_yield_from_ISR(woken);

        _GPIO_DDI_clear_pin(IOCTL_GPIO_PORT_IDX__TEST4, IOCTL_GPIO_PIN_IDX__TEST4); //TEST
}

//==============================================================================
/**
 * @brief  DMA IRQ handler
 * @param  DMA_ch_no    DMA channel number
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
#if USE_DMA > 0
static void IRQ_DMA_handler(const int DMA_ch_no, u8_t major)
{
        bool is_error = false;

        if (DMA_ch_no < 2) {
                is_error = (DMA1->LISR & DMA_LISR_TEIF0) << (6 * (DMA_ch_no - 0));
        } else if (DMA_ch_no < 4) {
                is_error = (DMA1->LISR & DMA_LISR_TEIF2) << (6 * (DMA_ch_no - 2));
        } else if (DMA_ch_no < 6) {
                is_error = (DMA1->HISR & DMA_HISR_TEIF4) << (6 * (DMA_ch_no - 4));
        } else if (DMA_ch_no < 8) {
                is_error = (DMA1->HISR & DMA_HISR_TEIF6) << (6 * (DMA_ch_no - 6));
        }

        if (is_error) {
                I2C[major]->error = EIO;
        }

        bool woken = false;
        sys_semaphore_signal_from_ISR(I2C[major]->event, &woken);
        clear_DMA_IRQ_flags(major);
        sys_thread_yield_from_ISR(woken);
}
#endif

//==============================================================================
/**
 * @brief  I2C1 Event IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C1EN)
void I2C1_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C1);
}
#endif

//==============================================================================
/**
 * @brief  I2C1 Error IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C1EN)
void I2C1_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C1);
}
#endif

//==============================================================================
/**
 * @brief  I2C2 Event IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C2EN)
void I2C2_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C2);
}
#endif

//==============================================================================
/**
 * @brief  I2C2 Error IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C2EN)
void I2C2_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C2);
}
#endif

//==============================================================================
/**
 * @brief  I2C3 Event IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C3EN)
void I2C3_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C3);
}
#endif

//==============================================================================
/**
 * @brief  I2C3 Error IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C3EN)
void I2C3_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C3);
}
#endif

#if defined(RCC_APB1ENR_I2C1EN) && (_I2C1_USE_DMA > 0)
//==============================================================================
/**
 * @brief  I2C1 DMA Tx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
void DMA1_Stream6_IRQHandler(void)
{
        IRQ_DMA_handler(I2C_INFO[_I2C1].DMA_tx_number, _I2C1);
}

//==============================================================================
/**
 * @brief  I2C1 DMA Rx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
void DMA1_Stream5_IRQHandler(void)
{
        IRQ_DMA_handler(I2C_INFO[_I2C1].DMA_rx_number, _I2C1);
}
#endif

#if defined(RCC_APB1ENR_I2C2EN) && (_I2C2_USE_DMA > 0)
//==============================================================================
/**
 * @brief  I2C2 DMA Tx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
void DMA1_Stream7_IRQHandler(void)
{
        IRQ_DMA_handler(I2C_INFO[_I2C2].DMA_tx_number, _I2C2);
}

//==============================================================================
/**
 * @brief  I2C2 DMA Rx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
void DMA1_Stream3_IRQHandler(void)
{
        IRQ_DMA_handler(I2C_INFO[_I2C2].DMA_rx_number, _I2C2);
}
#endif

#if defined(RCC_APB1ENR_I2C3EN) && (_I2C3_USE_DMA > 0)
//==============================================================================
/**
 * @brief  I2C2 DMA Tx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
void DMA1_Stream4_IRQHandler(void)
{
        IRQ_DMA_handler(I2C_INFO[_I2C3].DMA_tx_number, _I2C3);
}

//==============================================================================
/**
 * @brief  I2C2 DMA Rx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
void DMA1_Stream2_IRQHandler(void)
{
        IRQ_DMA_handler(I2C_INFO[_I2C3].DMA_rx_number, _I2C3);
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
